<a href="https://colab.research.google.com/github/semishen/ML100Days/blob/master/Day_022_HW.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 作業 : (Kaggle)鐵達尼生存預測精簡版 
https://www.kaggle.com/c/titanic

# [作業目標]
- 試著不依賴說明, 只依照下列程式碼回答下列問題, 初步理解什麼是"特徵工程"的區塊

# [作業重點]
- 試著不依賴註解, 以之前所學, 回答下列問題

# 作業1

### Q1: 下列A~E五個程式區塊中，哪一塊是特徵工程?
### A1: C 程式區塊為特徵工程。

<br/>

# 作業2

### Q2: 對照程式區塊 B 與 C 的結果，請問那些欄位屬於"類別型欄位"? (回答欄位英文名稱即可) 
### A2: Name, Sex, Ticket, Cabin, Embarked 為類別型欄位

<br/>

# 作業3
### Q3: 續上題，請問哪個欄位是"目標值"?
### A3: Survived 為目標值

In [24]:
# 程式區塊 A
import pandas as pd
import numpy as np
from sklearn.preprocessing import LabelEncoder, MinMaxScaler

df_train = pd.read_csv('titanic_train.csv')
df_test = pd.read_csv('titanic_test.csv')
print('df_train shape: ', df_train.shape)
print('df_test shape: ', df_test.shape)

df_train shape:  (891, 12)
df_test shape:  (418, 11)

In [25]:
# 程式區塊 B
train_Y = df_train['Survived'] # extract train target data 
ids = df_test['PassengerId'] # get test id data
df_train = df_train.drop(['PassengerId', 'Survived'] , axis=1) # drop inconsiderable train data
df_test = df_test.drop(['PassengerId'] , axis=1) # drop inconsiderable test data
df = pd.concat([df_train,df_test]) # features match btwn train and test 
df.head()

   Pclass                                               Name  ... Cabin  Embarked
0       3                            Braund, Mr. Owen Harris  ...   NaN         S
1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...  ...   C85         C
2       3                             Heikkinen, Miss. Laina  ...   NaN         S
3       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  ...  C123         S
4       3                           Allen, Mr. William Henry  ...   NaN         S

[5 rows x 10 columns]

In [26]:
df.dtypes.value_counts() # observe all types of features

object     5
int64      3
float64    2
dtype: int64

In [0]:
df_backup = df.copy()

In [0]:
df = df_backup.copy()

In [28]:
# 程式區塊 C
LEncoder = LabelEncoder()
MMEncoder = MinMaxScaler()
for c in df.columns:
    df[c] = df[c].fillna(-1) # replace NaN with -1
    # if df[c].dtype == 'object':
    #     df[c] = LEncoder.fit_transform(list(df[c].values)) # label encoding
    # df[c] = MMEncoder.fit_transform(df[c].values.reshape(-1, 1)) # match matrix shape
df.head()

   Pclass                                               Name  ... Cabin  Embarked
0       3                            Braund, Mr. Owen Harris  ...    -1         S
1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...  ...   C85         C
2       3                             Heikkinen, Miss. Laina  ...    -1         S
3       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  ...  C123         S
4       3                           Allen, Mr. William Henry  ...    -1         S

[5 rows x 10 columns]

In [29]:
for c in df.columns:
    if df[c].dtype == 'object':
        df[c] = LEncoder.fit_transform(list(df[c].values)) # label encoding
    # df[c] = MMEncoder.fit_transform(df[c].values.reshape(-1, 1)) # match matrix shape
df.head()

   Pclass  Name  Sex   Age  SibSp  Parch  Ticket     Fare  Cabin  Embarked
0       3   155    1  22.0      1      0     720   7.2500      0         3
1       1   286    0  38.0      1      0     816  71.2833    107         1
2       3   523    0  26.0      0      0     914   7.9250      0         3
3       1   422    0  35.0      1      0      65  53.1000     71         3
4       3    22    1  35.0      0      0     649   8.0500      0         3

In [31]:
for c in df.columns:
    df[c] = MMEncoder.fit_transform(df[c].values.reshape(-1, 1)) # match matrix shape 1D to 2D
df.head()

   Pclass      Name  Sex       Age  ...    Ticket      Fare     Cabin  Embarked
0     1.0  0.118683  1.0  0.283951  ...  0.775862  0.016072  0.000000  1.000000
1     0.0  0.218989  0.0  0.481481  ...  0.879310  0.140813  0.575269  0.333333
2     1.0  0.400459  0.0  0.333333  ...  0.984914  0.017387  0.000000  1.000000
3     0.0  0.323124  0.0  0.444444  ...  0.070043  0.105390  0.381720  1.000000
4     1.0  0.016845  1.0  0.444444  ...  0.699353  0.017630  0.000000  1.000000

[5 rows x 10 columns]

In [0]:
# 程式區塊 D
train_num = train_Y.shape[0] # get length of target
train_X = df[:train_num] # restore concated df
test_X = df[train_num:] # restore concated df

from sklearn.linear_model import LogisticRegression
estimator = LogisticRegression()
estimator.fit(train_X, train_Y)
pred = estimator.predict(test_X)

In [0]:
# 程式區塊 E
sub = pd.DataFrame({'PassengerId': ids, 'Survived': pred})
sub.to_csv('titanic_baseline_by_semisu.csv', index=False)